app/controllers/equipment_controller.rb

  def index
    @equipment = Equipment.all
---
SELECT "equipment".* FROM "equipment"

  def create
    @equipment = Equipment.new(equipment_params)

    if @equipment.save
---
INSERT INTO "equipment" ("vendor", "machine", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["vendor", "GE"], ["machine", "SLM 500"], ["created_at", "2018-08-09 14:07:53.375759"], ["updated_at", "2018-08-09 14:07:53.375759"]]

  def update
    if @equipment.update(equipment_params)
---
UPDATE "equipment" SET "updated_at" = ? WHERE "equipment"."id" = ?  [["updated_at", "2018-08-09 14:07:53.383355"], ["id", 1]]