app/controllers/maintenances_controller.rb

  def index
    @maintenances = Maintenance.all
---
SELECT "maintenances".* FROM "maintenances"

  def create
    @maintenance = Maintenance.new(maintenance_params)

    if @maintenance.save
---
INSERT INTO "maintenances" ("maintenance_date", "machine", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["maintenance_date", "6/2"], ["machine", "SLM 500"], ["created_at", "2018-08-09 14:03:41.634924"], ["updated_at", "2018-08-09 14:03:41.634924"]]

  def update
    if @maintenance.update(maintenance_params)
---
UPDATE "maintenances" SET "updated_at" = ? WHERE "maintenances"."id" = ?  [["updated_at", "2018-08-09 14:03:41.638338"], ["id", 1]]