app/controllers/materials_controller.rb

  def index
    @materials = Material.all
---
SELECT "materials".* FROM "materials"

  def create

    @material = Material.new(material_params)

    if @material.save
---
INSERT INTO "materials" ("material_type", "vendor", "process", "file_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["material_type", "this"], ["vendor", "is"], ["process", "hecked"], ["file_url", "empty"], ["created_at", "2018-08-09 11:49:59.988866"], ["updated_at", "2018-08-09 11:49:59.988866"]]

  def update
    if @material.update(material_params)
---
UPDATE "materials" SET "updated_at" = ? WHERE "materials"."id" = ?  [["updated_at", "2018-08-09 03:02:58.206523"], ["id", 1]]

    def set_material
      @material = Material.find(params[:id])
---
SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]