app/controllers/operating_procedures_controller.rb

SELECT "operating_procedures".* FROM "operating_procedures"
---
  def index
    @operating_procedures = OperatingProcedure.all

INSERT INTO "operating_procedures" ("op_number", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["op_number", "1"], ["title", "titel"], ["created_at", "2018-08-09 13:43:39.087368"], ["updated_at", "2018-08-09 13:43:39.087368"]]
---
  def create
    @operating_procedure = OperatingProcedure.new(operating_procedure_params)

    if @operating_procedure.save

UPDATE "operating_procedures" SET "updated_at" = ? WHERE "operating_procedures"."id" = ?  [["updated_at", "2018-08-09 13:43:39.094770"], ["id", 1]]
---
  def update
    if @operating_procedure.update(operating_procedure_params)