app/controllers/standards_controller.rb

  def index
    @standards = Standard.all
---
SELECT "standards".* FROM "standards"

  def create
    @standard = Standard.new(standard_params)

    if @standard.save
---
INSERT INTO "standards" ("standard_number", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["standard_number", "123432"], ["title", "title"], ["created_at", "2018-08-09 13:20:09.284605"], ["updated_at", "2018-08-09 13:20:09.284605"]]

  def update
    if @standard.update(standard_params)
---
UPDATE "standards" SET "updated_at" = ? WHERE "standards"."id" = ?  [["updated_at", "2018-08-09 13:14:13.926077"], ["id", 1]]